/*
    Copyright (C) 2007 Tim Seidel
    Copyright (C) 2014 pleonex
    Copyright (C) 2008-2018 DeSmuME team

    This file is part of DeSmuME

    DeSmuME is free software; you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation; either version 2 of the License, or
    (at your option) any later version.

    DeSmuME is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with DeSmuME; if not, write to the Free Software
    Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
*/

#ifndef WIFI_H
#define WIFI_H

#include <stdio.h>
#include "types.h"

#include <deque>
#include <string>
#include <vector>

#define		REG_WIFI_ID					0x000
#define     REG_WIFI_MODE       		0x004
#define     REG_WIFI_WEP        		0x006
#define		REG_WIFI_TXSTATCNT			0x008
#define		REG_WIFI_X_00A				0x00A
#define     REG_WIFI_IF     			0x010
#define     REG_WIFI_IE     			0x012
#define     REG_WIFI_MAC0       		0x018
#define     REG_WIFI_MAC1       		0x01A
#define     REG_WIFI_MAC2       		0x01C
#define     REG_WIFI_BSS0       		0x020
#define     REG_WIFI_BSS1       		0x022
#define     REG_WIFI_BSS2       		0x024

#define 	REG_WIFI_BEACONCOUNT1		0x11C

#define		REG_WIFI_CONFIG_120			0x120
#define		REG_WIFI_CONFIG_122			0x122
#define		REG_WIFI_CONFIG_124			0x124
#define		REG_WIFI_CONFIG_128			0x128
#define		REG_WIFI_CONFIG_130			0x130
#define		REG_WIFI_CONFIG_132			0x132
#define 	REG_WIFI_BEACONCOUNT2		0x134
#define		REG_WIFI_CONFIG_140			0x140
#define		REG_WIFI_CONFIG_142			0x142
#define		REG_WIFI_CONFIG_144			0x144
#define		REG_WIFI_CONFIG_146			0x146
#define		REG_WIFI_CONFIG_148			0x148
#define		REG_WIFI_CONFIG_14A			0x14A
#define		REG_WIFI_CONFIG_14C			0x14C
#define		REG_WIFI_CONFIG_150			0x150
#define		REG_WIFI_CONFIG_154			0x154

#define     REG_WIFI_BBCNT				0x158
#define     REG_WIFI_BBWRITE			0x15A
#define     REG_WIFI_BBREAD				0x15C
#define     REG_WIFI_BBBUSY				0x15E
#define		REG_WIFI_BBMODE				0x160
#define		REG_WIFI_BBPOWER			0x168

// 16A to 178 - internal

#define     REG_WIFI_RFDATA2  			0x17C
#define     REG_WIFI_RFDATA1  			0x17E
#define     REG_WIFI_RFBUSY				0x180
#define     REG_WIFI_RFCNT		  		0x184

// 190 - internal
#define		REG_WIFI_TX_HDR_CNT			0x194
// 198 - internal
#define		REG_WIFI_RFPINS				0x19C
#define		REG_WIFI_X_1A0				0x1A0
#define		REG_WIFI_X_1A2				0x1A2
#define		REG_WIFI_X_1A4				0x1A4

#define		REG_WIFI_RXSTAT_INC_IF		0x1A8
#define		REG_WIFI_RXSTAT_INC_IE		0x1AA
#define		REG_WIFI_RXSTAT_OVF_IF		0x1AC
#define		REG_WIFI_RXSTAT_OVF_IE		0x1AE
#define		REG_WIFI_RXSTAT0			0x1B0
#define		REG_WIFI_RXSTAT1			0x1B2
#define		REG_WIFI_RXSTAT2			0x1B4
#define		REG_WIFI_RXSTAT3			0x1B6
#define		REG_WIFI_RXSTAT4			0x1B8
#define		REG_WIFI_RXSTAT5			0x1BA
#define		REG_WIFI_RXSTAT6			0x1BC
#define		REG_WIFI_RXSTAT7			0x1BE
#define		REG_WIFI_TXERR_COUNT		0x1C0
#define		REG_WIFI_RX_COUNT			0x1C4

#define		REG_WIFI_CMD_STAT0			0x1D0
#define		REG_WIFI_CMD_STAT1			0x1D2
#define		REG_WIFI_CMD_STAT2			0x1D4
#define		REG_WIFI_CMD_STAT3			0x1D6
#define		REG_WIFI_CMD_STAT4			0x1D8
#define		REG_WIFI_CMD_STAT5			0x1DA
#define		REG_WIFI_CMD_STAT6			0x1DC
#define		REG_WIFI_CMD_STAT7			0x1DE

#define		REG_WIFI_RFSTATUS			0x214
#define		REG_WIFI_IF_SET				0x21C
#define 	REG_WIFI_TXSEQNO			0x210
#define		REG_WIFI_X_228				0x228
#define		REG_WIFI_X_244				0x244
#define		REG_WIFI_CONFIG_254			0x254
#define		REG_WIFI_RXTX_ADDR			0x268
#define		REG_WIFI_X_290				0x290
#define		REG_WIFI_POWERACK			0x2D0

/* WIFI misc constants */
#define		WIFI_CHIPID					0x1440		/* emulates "old" wifi chip, new is 0xC340 */

#define		WIFI_WORKING_PACKET_BUFFER_SIZE (16 * 1024 * sizeof(u8)) // 16 KB size

class WifiHandler;
class Task;
struct slock;
typedef slock slock_t;

// RF2958 Register Addresses
enum RegAddrRF2958
{
	REG_RF2958_CFG1			= 0,
	REG_RF2958_IPLL1		= 1,
	REG_RF2958_IPLL2		= 2,
	REG_RF2958_IPLL3		= 3,
	REG_RF2958_RFPLL1		= 4,
	REG_RF2958_RFPLL2		= 5,
	REG_RF2958_RFPLL3		= 6,
	REG_RF2958_RFPLL4		= 7,
	REG_RF2958_CAL1			= 8,
	REG_RF2958_TXRX1		= 9,
	REG_RF2958_PCNT1		= 10,
	REG_RF2958_PCNT2		= 11,
	REG_RF2958_VCOT1		= 12,
	REG_RF2958_TEST			= 27,
	REG_RF2958_RESET		= 31
};

typedef struct
{
	u32 powerOn;
	u32 powerOnPending;
	
	u16 rfStatus;
	u16 rfPins;
	
	u16 IE;
	u16 IF;
	
	u16 macMode;
	u16 wepMode;
	u32 WEP_enable;
	
	u16 TXCnt;
	u16 TXStat;
	
	u16 RXCnt;
	u16 RXCheckCounter;
	
	u8 macAddr[6];
	u8 bssid[6];
	
	u16 aid;
	u16 pid;
	u16 retryLimit;
	
	u32 crystalEnabled;
	u64 usec;
	u32 usecEnable;
	u64 ucmp;
	u32 ucmpEnable;
	u16 eCount;
	u32 eCountEnable;
	
	u32 rf_cfg1;
	u32 rf_ifpll1;
	u32 rf_ifpll2;
	u32 rf_ifpll3;
	u32 rf_rfpll1;
	u32 rf_rfpll2;
	u32 rf_rfpll3;
	u32 rf_rfpll4;
	u32 rf_cal1;
	u32 rf_txrx1;
	u32 rf_pcnt1;
	u32 rf_pcnt2;
	u32 rf_vcot1;
	
	u8 bb_data[105];
	
	u16 rfIOCnt;
	u16 rfIOStatus;
	u32 rfIOData;
	u16 bbIOCnt;
	
	u8 wifiRAM[0x2000];
	u16 rxRangeBegin;
	u16 rxRangeEnd;
	u16 rxWriteCursor;
	u16 rxReadCursor;
	u16 rxUnits;
	u16 rxBufCount;
	u16 circBufReadAddress;
	u16 circBufWriteAddress;
	u16 circBufReadEnd;
	u16 circBufReadSkip;
	u16 circBufWriteEnd;
	u16 circBufWriteSkip;
	
	u16 wifiIOPorts[0x800];
	u16 randomSeed;
} LegacyWifiSFormat;

typedef union
{
	u32 value;
	
	struct
	{
		u32 Data:18;
		u32 :14;
	};
	
	struct
	{
#ifndef MSB_FIRST
		u16 DataLSB:16;
		
		u16 DataMSB:2;
		u16 :6;
		
		u16 :8;
#else
		u16 DataLSB:16;
		
		u16 :6;
		u16 DataMSB:2;
		
		u16 :8;
#endif
	};
} RFREG_RF2958;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u8 IF_VGA_REG_EN:1;
		u8 IF_VCO_REG_EN:1;
		u8 RF_VCO_REG_EN:1;
		u8 HYBERNATE:1;
		u8 :4;
		
		u8 :6;
		u8 REF_SEL:2;
		
		u8 reserved:2;
		u8 :6;
		
		u8 :8;
#else
		u8 :4;
		u8 HYBERNATE:1;
		u8 RF_VCO_REG_EN:1;
		u8 IF_VCO_REG_EN:1;
		u8 IF_VGA_REG_EN:1;
		
		u8 REF_SEL:2;
		u8 :6;
		
		u8 :6;
		u8 reserved:2;
		
		u8 :8;
#endif
	};
} RFREG_CFG1;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u8 DAC:4;
		u8 reserved1:4;
		
		u8 reserved2:1;
		u8 P1:1;
		u8 LD_EN1:1;
		u8 AUTOCAL_EN1:1;
		u8 PDP1:1;
		u8 CPL1:1;
		u8 LPF1:1;
		u8 VTC_EN1:1;
		
		u8 KV_EN1:1;
		u8 PLL_EN1:1;
		u8 :6;
		
		u8 :8;
#else
		u8 reserved1:4;
		u8 DAC:4;
		
		u8 VTC_EN1:1;
		u8 LPF1:1;
		u8 CPL1:1;
		u8 PDP1:1;
		u8 AUTOCAL_EN1:1;
		u8 LD_EN1:1;
		u8 P1:1;
		u8 reserved2:1;
		
		u8 :6;
		u8 PLL_EN1:1;
		u8 KV_EN1:1;
		
		u8 :8;
#endif
	};
} RFREG_IFPLL1;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u16 IF_N:16;
		
		u8 reserved:2;
		u8 :6;
		
		u8 :8;
#else
		u16 IF_N:16;
		
		u8 :6;
		u8 reserved:2;
		
		u8 :8;
#endif
	};
} RFREG_IFPLL2;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u8 KV_DEF1:4;
		u8 CT_DEF1:4;
		
		u16 DN1:9;
		u16 reserved:1;
		u16 :6;
		
		u8 :8;
#else
		u8 CT_DEF1:4;
		u8 KV_DEF1:4;
		
		u16 :6;
		u16 reserved:1;
		u16 DN1:9;
		
		u8 :8;
#endif
	};
} RFREG_IFPLL3;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u8 DAC:4;
		u8 reserved1:4;
		
		u8 reserved2:1;
		u8 P:1;
		u8 LD_EN:1;
		u8 AUTOCAL_EN:1;
		u8 PDP:1;
		u8 CPL:1;
		u8 LPF:1;
		u8 VTC_EN:1;
		
		u8 KV_EN:1;
		u8 PLL_EN:1;
		u8 :6;
		
		u8 :8;
#else
		u8 reserved1:4;
		u8 DAC:4;
		
		u8 VTC_EN:1;
		u8 LPF:1;
		u8 CPL:1;
		u8 PDP:1;
		u8 AUTOCAL_EN:1;
		u8 LD_EN:1;
		u8 P:1;
		u8 reserved2:1;
		
		u8 :6;
		u8 PLL_EN:1;
		u8 KV_EN:1;
		
		u8 :8;
#endif
	};
} RFREG_RFPLL1;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u16 NUM2:6;
		u16 N2:12;
		u16 :6;
		
		u8 :8;
#else
		u16 :6;
		u16 N2:12;
		u16 NUM2:6;
		
		u8 :8;
#endif
	};
} RFREG_RFPLL2;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u32 NUM2:18;
		u32 :6;
		
		u8 :8;
#else
		u32 :6;
		u32 NUM2:18;
		
		u8 :8;
#endif
	};
} RFREG_RFPLL3;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u8 KV_DEF:4;
		u8 CT_DEF:4;
		
		u16 DN:9;
		u16 reserved:1;
		u16 :6;
		
		u8 :8;
#else
		u8 CT_DEF:4;
		u8 KV_DEF:4;
		
		u16 :6;
		u16 reserved:1;
		u16 DN:9;
		
		u8 :8;
#endif
	};
} RFREG_RFPLL4;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u8 LD_WINDOW:3;
		u8 M_CT_VALUE:5;
		
		u16 TLOCK:5;
		u16 TVCO:5;
		u16 :6;
		
		u8 :8;
#else
		u8 M_CT_VALUE:5;
		u8 LD_WINDOW:3;
		
		u16 :6;
		u16 TVCO:5;
		u16 TLOCK:5;
		
		u8 :8;
#endif
	};
} RFREG_CAL1;

typedef union
{
	u32 value;
	
	struct
	{
		u32 TXBYPASS:1;
		u32 INTBIASEN:1;
		u32 TXENMODE:1;
		u32 TXDIFFMODE:1;
		u32 TXLPFBW:3;
		u32 RXLPFBW:3;
		u32 TXVGC:5;
		u32 PCONTROL:2;
		u32 RXDCFBBYPS:1;
		u32 :6;
		
		u8 :8;
	};
} RFREG_TXRX1;

typedef union
{
	u32 value;
	
	struct
	{
		u32 TX_DELAY:3;
		u32 PC_OFFSET:6;
		u32 P_DESIRED:6;
		u32 MID_BIAS:3;
		u32 :6;
		
		u8 :8;
	};
} RFREG_PCNT1;

typedef union
{
	u32 value;
	
	struct
	{
		u32 MIN_POWER:6;
		u32 MID_POWER:6;
		u32 MAX_POWER:6;
		u32 :6;
		
		u8 :8;
	};
} RFREG_PCNT2;

typedef union
{
	u32 value;
	
	struct
	{
#ifndef MSB_FIRST
		u16 reserved:16;
		
		u8 AUX1:1;
		u8 AUX:1;
		u8 :6;
		
		u8 :8;
#else
		u16 reserved:16;
		
		u8 :6;
		u8 AUX:1;
		u8 AUX1:1;
		
		u8 :8;
#endif
	};
} RFREG_VCOT1;

// This struct is based on the RF2958 chip from RF Micro Devices.
// All register names match the names that are on the RF2958 Datasheet:
// https://pdf1.alldatasheet.com/datasheet-pdf/view/116332/RFMD/RF2958/+0154WWVOELEbTptEC.+/datasheet.pdf
//
// Note that all the registers are 18 bits in length. However, for the sake of compatibility,
// we pad out each registers to 32 bits.

#include "PACKED.h"
typedef union
{
	RFREG_RF2958 reg[32];
	
	struct
	{
		RFREG_CFG1		CFG1;			// 0
		RFREG_IFPLL1	IFPLL1;			// 1
		RFREG_IFPLL2	IFPLL2;			// 2
		RFREG_IFPLL3	IFPLL3;			// 3
		RFREG_RFPLL1	RFPLL1;			// 4
		RFREG_RFPLL2	RFPLL2;			// 5
		RFREG_RFPLL3	RFPLL3;			// 6
		RFREG_RFPLL4	RFPLL4;			// 7
		RFREG_CAL1		CAL1;			// 8
		RFREG_TXRX1		TXRX1;			// 9
		RFREG_PCNT1		PCNT1;			// 10
		RFREG_PCNT2		PCNT2;			// 11
		RFREG_VCOT1		VCOT1;			// 12
		
		RFREG_RF2958	PADDING_13;		// 13
		RFREG_RF2958	PADDING_14;		// 14
		RFREG_RF2958	PADDING_15;		// 15
		RFREG_RF2958	PADDING_16;		// 16
		RFREG_RF2958	PADDING_17;		// 17
		RFREG_RF2958	PADDING_18;		// 18
		RFREG_RF2958	PADDING_19;		// 19
		RFREG_RF2958	PADDING_20;		// 20
		RFREG_RF2958	PADDING_21;		// 21
		RFREG_RF2958	PADDING_22;		// 22
		RFREG_RF2958	PADDING_23;		// 23
		RFREG_RF2958	PADDING_24;		// 24
		RFREG_RF2958	PADDING_25;		// 25
		RFREG_RF2958	PADDING_26;		// 26
		
		RFREG_RF2958	TEST;			// 27
		
		RFREG_RF2958	PADDING_28;		// 28
		RFREG_RF2958	PADDING_29;		// 29
		RFREG_RF2958	PADDING_30;		// 30
		
		RFREG_RF2958	RESET;			// 31
	};
} RF2958_IOREG_MAP;
#include "PACKED_END.h"

/* baseband chip refered as BB_, dataformat is unknown yet */
/* it has at least 105 bytes of functional data */
typedef struct
{
	u8    data[105];
} bb_t;

enum WifiRFStatus
{
	WifiRFStatus0_Initial			= 0,
	WifiRFStatus1_TXComplete		= 1,
	WifiRFStatus2_TransitionRXTX	= 2,
	WifiRFStatus3_TXEnabled			= 3,
	WifiRFStatus4_TransitionTXRX	= 4,
	WifiRFStatus5_MPHostReplyWait	= 5,
	WifiRFStatus6_RXEnabled			= 6,
	WifiRFStatus7_UNKNOWN7			= 7,
	WifiRFStatus8_MPHostAcknowledge	= 8,
	WifiRFStatus9_Idle				= 9
};

enum WifiIRQ
{
	WifiIRQ00_RXComplete			= 0,
	WifiIRQ01_TXComplete			= 1,
	WifiIRQ02_RXEventIncrement		= 2,
	WifiIRQ03_TXErrorIncrement		= 3,
	WifiIRQ04_RXEventOverflow		= 4,
	WifiIRQ05_TXErrorOverflow		= 5,
	WifiIRQ06_RXStart				= 6,
	WifiIRQ07_TXStart				= 7,
	WifiIRQ08_TXCountExpired		= 8,
	WifiIRQ09_RXCountExpired		= 9,
	WifiIRQ10_UNUSED				= 10,
	WifiIRQ11_RFWakeup				= 11,
	WifiIRQ12_UNKNOWN				= 12,
